In [3]:
# DataFrame
# 표 같은 스프레드시트 형식의 자료구조이다.
# 여러 컬럼이 있는데, 각 컬럼은 서로 다른 종류의 값(숫자, 문자열, 불리언 등) 을 담을 수 있다.
import pandas as pd


data = {'state' : ['Ohio', 'Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year'  : [2000, 2001, 2002, 2001, 2002, 2001],
        'pop'   : [1.5, 1.7, 3.6, 2.4, 2.9,1.1]}

frame = pd.DataFrame(data)

# jupyter 노트북 사용시 html 코드 형식으로 출력된다.
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2001  1.1

In [4]:
# 처음 다섯개만 출력
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
# 컬럼의 출력을 변경
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2001  Nevada  1.1

In [6]:
# 사전에 없는 값을 넘기면 결측치로 저장된다.
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index = ['one', 'two', 'three', 'four', 'five', 'six'])

frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2001  Nevada  1.1  NaN

In [7]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [8]:
# DataFrame 의 컬럼은 Series 처럼 사전 형식의 표기법으로 접근하거나 속성 형식으로 접근할 수 있다.
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [9]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2001
Name: year, dtype: int64

In [10]:
# 반환된 Series 객체가 DataFrame 과 같은 색인을 가지면 알맞은 값으로 name 속성이 채워진다.
# 로우는 위치나 loc 속성을 이용해서 이름을 통해 접근할 수 있다.
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [12]:
# 컬럼은 대입이 가능하다. 현재 비어있는 'debt' 컬럼에 스칼라값이나 배열의 값을 대입할 수 있다.
frame2['debt'] = 16.5

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2001  Nevada  1.1  16.5

In [15]:
# 리스트나 배열을 칼럼에 대입할 때는 대입하려는 값의 길이가 DataFrame의 크기와 동일해야 한다.
# Series 를 대입하면 DataFrame의 색인에 따라 값이 대입되며 존재하지 않는 색인에는 결측치가 대입된다.

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2001  Nevada  1.1   NaN

In [17]:
frame2['eastern'] = frame2.state == 'Ohio'

frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2001  Nevada  1.1   NaN    False

In [22]:
# del 예약어를 사용하여 컬럼을 삭제할 수 있다.
# del frame2['eastern']

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2001  Nevada  1.1   NaN

In [23]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [26]:
# 중첩된 사전형 데이터를 이용하여 dataFrame 생성이 가능하다.
pop = {'Nevada' : {2001:2.4, 2002:2.9},
       'Ohio' : {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)

frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [27]:
# 데이터를 전치할 수 있다.
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [29]:
# 색인객체
# 색인객체는 표 형식의 데이터에서 각 로우와 컬럼에 대한 이름과 다른 메타데이터를 저장하는 객체이다.
# Series 나 DataFrame 객체를 생성할 때, 사용되는 배열이나 다른 순차적인 이름은 내부적으로 색인으로 변환된다.

obj = pd.Series(range(3), index = ['a','b','c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [30]:
index[1:] # index 1 ~

Index(['b', 'c'], dtype='object')

In [31]:
# 색인객체는 변경이 불가능하다.
index[1] = 'd' # TypeError 발생

TypeError: Index does not support mutable operations

In [32]:
# 색인객체는 변경이 불가능 하기 때문에 자료구조 사이에서 안전하게 공유가 가능하다.

In [33]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [34]:
'Ohio' in frame3.columns

True

In [35]:
2003 in frame3.index

False

In [36]:
# pandas 는 중복되는 값을 허용한다.

dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')